export function htmlPost(){
    return `
        <div class="record-container">
            <i class="fa fa-long-arrow-left" style="font-size:24px"></i>
            <p class="post-record">
                Հայաստանի ազգային օլիմպիական կոմիտեի նախագահ Գագիկ Ծառուկյանը ողջունեց «Ալբերտ Ազարյանի անվան գավաթ» 
                միջազգային մրցաշարի մասնակիցներին: Մրցաշարի բացման ժամանակ 14-ամյա Հայկ Պետրոսյանը պտտաձողի վրա կատարել
                ով 386 պտույտ՝ գերազանցեց Գինեսի գրքի կրկնակի ռեկորդակիր Դ.Ֆահրադյանի կողմից 2009թ-ին սահմանած ռեկորդը:
                Մարզիկը սահմանեց նոր միջազգային ռեկորդ, որը նվիրվեց ՀԱՕԿ նախագահ Գագիկ Ծառուկյանին: Ի պատասխան ՀԱՕԿ նախագահը 
                նոր ռեկորդակրին նվիրեց ավտոմեքենա՝ մաղթելով նոր հաղթանակներ և նվաճումներ: <br><br>
                President of the National Olympic Committee of Armenia Gagik Tsarukyan welcomed the participants of the international 
                tournament "Cup after Albert Azarian". During the opening of the tournament the 14 years old Hayk Petrossian made 
                386 turns on a horizontal bar, improving the record set in 2009 by double Guinness record holder David Fahradyan.
                Athlete set new world record and dedicated to NOCA President Gagik Tsarukyan. In response, NOCA President presented 
                car to the new record holder and wished new victories and achievements.
            </p>
            <div class="iframe-container">
                <iframe class="iframe" width="560" height="315" src="https://www.youtube.com/embed/3BD2q9sgrG4" 
                title="YouTube video player" frameborder="0" allow="accelerometer; autoplay; clipboard-write; 
                encrypted-media; gyroscope; picture-in-picture" allowfullscreen></iframe>
                <iframe class="iframe2" width="560" height="315" src="https://www.youtube.com/embed/A3v6kFk_eg8" 
                title="YouTube video player" frameborder="0" allow="accelerometer; autoplay; clipboard-write; 
                encrypted-media; gyroscope; picture-in-picture" allowfullscreen></iframe>
            </div>
        </div>
    `;
}

export function htmlPostArticle(){
    return `
        <div class="article-container">
        <i class="fa fa-long-arrow-left" style="font-size:24px"></i>
            <div>
                ՀԱՅ-ՎՐԱՑԱԿԱՆ ՀԱՐԱԲԵՐՈՒԹՅՈՒՆՆԵՐԸ ԺԲ ԴԱՐԻ ԱՌԱՋԻՆ ՔԱՌՈՐԴԻՆ
            </div>

            <br>
            <div class="article-context">
                ԺԲ դարի առաջին քառորդի հայ-վրացական հարաբերությունները քննարկելիս հատուկ ուշադրության  են արժանի Վրացական թագավորության սահմանների մեջ հայկական մի շարք տարածքների ընդգրկումը, մասնավորապես հայ Բագրատունիների երբեմնի մայրաքաղաք Անիի նվաճումը, հայ-վրացական համագործակցությունը, հայոց և վրաց եկեղեցիների միջև առաջացած դավանաբանական խնդիրները, ինչպես նաև վրացական բանակում հայերի ունեցած դերն և նշանակությունը: Այս համատեքստում Տաշիր-Ձորագետի թագավորության անցումը Վրաստանին առանձին վերլուծության  կարիք ունի՝ հաշվի առնելով այն հանգամանքը, որ 1918թ. Հայաստանի Հանրապետության և Վրաստանի Հանրապետության միջև պատերազմի պատճառ դարձած տարածքային վեճերը, առաջին հերթին, կապված էին Լոռու հետ:
                    Հայ-վրացական հարաբերությունների սերտացումը ԺԲ դարում մեծապես պայմանավորված էր Վրացական թագավորության հզորացմամբ: Նման պայմաններում հայկական ուժերը միավորվեցին վրացական զորքերի հետ և աստիճանաբար սկսեցին ազատագրել սեփական տարածքները թյուրքական լծից: Վրաց արքա Դավիթ Դ Շինարարը (1089-1125), ավարտին հասցնելով երկրի հյուսիսային ու արևմտյան հատվածների միավորումը, պայքար սկսեց հարավային հատվածի, Քվեմո(Ստորին) Քարթլիի համար, որի կազմում վրաց իրականության մեջ հասկացվում էին նաև Հյուսիսային Հայաստանի մի շարք տարածքներ այդ թվում Լոռե բերդաքաղաքը, որոնք Կյուրիկյանների օրոք մտնում էին Տաշիր-Ձորագետի թագավորության կազմի մեջ: Անիի թագավորության  անկումից և սելջուկ-թյուրքերի 1064 թ. արշավանքից հետո Կյուրիկյանների կենտրոն էր դարձել Սամշվիլդեն, որն էլ գրավվել էր նախ Վրացական թագավորության, ապա սելջուկ-թյուրքերի կողմից: Փաստորեն այս հանգամանքը թույլ տվեց Վրացական թագավորությանը հավակնություններ հանդես բերել հայկական տարածքների նկատմամբ։  Ընդ որում՝ պետք է նշել, որ հայ ժողովուրդը ընդհանրապես դրական վերաբերմունք էր ցուցաբերում դեպի Վրաստանը, քանի որ այդ կերպ, վրաց օգնությամբ,  հնարավոր էր ազատագրվել թյուրքական դաժան լծից: Փաստորեն վրաց արքան օգտվեց նաև այս հանգամանքից և հաջողություններ արձանագրեց վերոնշյալ տարածքներում։ 
                Դավիթ Շինարարի օրոք, հատկապես նրա կառավարման վերջին շրջանում, վրաց պատմությունը շաղկապվում է հայոց պատմության հետ, քանի որ Հյուսիսային Հայաստանը ընդգրկվել էր Վրացական թագավորության սահմանների մեջ, բազմակողմանի էին դարձել հայ-վրացական հարաբերությունները։ Վերոնշյալ իրադարձությունների ընթացքում, ինչպես ցույց են տալիս սկզբնաղբյուրները, հայերը մշտապես աջակցել են վրաց արքային իր նախաձեռնություններում: Դավիթ Դ-ի կողմից արդեն վրաց տարածքներից դուրս հավակնություններ հանդես բերելու ընթացքում՝ հայերը էական դերակատարություն ունեցան վրացական բանակի տարած հաղթանակներում: Սակայն, ինչպես երևում է, այս ամենի հետևանքներից դարձավ նաև այն, որ հայկական մի շարք տարածքներ զոհ գնացին Դավիթ Շինարարի նվաճողական քաղաքականությանը: 
                Այս առումով առաջին լուրջ հաջողությունը տեղի ունեցավ 1110 թ., երբ վրացական զորքերը գրավեցին Սամշվիլդեն: Իսկ ահա 1118 թ. վրացական զորքերը ջախջախեցին Արաքս գետի ափին ձմեռող թյուրքական հորդաներին, և նույն թվականին էլ վերցրեցին Լոռե և Ագարակ բերդերը։ §Եւ ընդարձակեալ Դաւիթ զսահմանս Վրաց, առեալ զՈւխթիս և զսահմանս իւր, և զԳագ, և զՏերունական, և զՏայուշ, և զԿայեան և զԿայծոն, և զԼոռէ և զՏաշիր, և զՄահկանաբերդ, և զբոլոր իշխանութիւնն Հայոց Կիւրիկէի և Աբասայ...¦: Ասպիսով, Դավիթ Դ-ը մեծ հաջողությունների է հասնում նաև Հյուսիսային Հայաստանում, որտեղ, Լոռեից և Ագարակից բացի, 1124 թ., տիրեց Անիին, ինչպես նաև Գագ, Տերունական, Նոր Բերդ, Մանասագոմ, Տավուշ, Մահկանաբերդ և այլ ամրոցներին: Սակայն Հայաստանի համար պայքարը այսքանով չսահմանափակվեց. Դավիթ Դ-ի հաջողությունները ընդհանուր թշնամու դեմ Վրաստանի սահմանակից հայաբնակ շրջաններում առաջ էին բերում ոգևորություն և հույս էին ներշնչում հայերին, որ Վրաստանի օգնությամբ իրենք ևս կկարողանան ոտքի կանգնել ու ազատվել օտար տիրապետությունից: Ինչպես վկայում է Քարթլիս-ցխովրեբան, օգոստոսի 20-ին ( 1124թ.) Դավթի մետ եկան Անեցի ավագների դպիրները և հայտնեցին քաղաքը նրան հանձնելու ցանկության մասին: Այս փաստը պայմանավորված էր նրանով, որ Անիի ամիրան՝ Մանուչեի որդի Աբուլ-Ասվարը, ցանկանում էր քաղաքը 60.000 դինարիով վաճառել Կարսի ամիրային: Բացի այդ, հայերը խիստ դժգոհ էին քաղաքի տիրակալ Շադդադյաններից, որովհետև նրանք Անիի Կաթուղիկե եկեղեցին վերածել էին մզկիթի: Դավիթ Դ-ը հավաքեց 60 հազարանոց զորք և գրավեց Անին իր շրջակա տարածքներով, իսկ Աբուլ-Ասվարը իր որդիների հետ գերի գերի ընկավ, ընդ որում՝ այս հաջողության մեջ շատ մեծ նշանակություն ունեցավ հայերի ակտիվ աջակցությունը: Անին գրավելուց հետո Դավիթ Դ-ը այնտեղ զորք տեղակայեց, իսկ քաղաքը պաշտպանելու համար զորահրամանատարներ կարգեց Աբուլեթ իշխանին և նրա որդուն՝ Իվանեին: Իր թագավորության մեջ ընդգրկելով նաև հայկական հողերը, Դավիթ Շինարարը դարձավ Այսրկովկասի մեծագույն մասի տիրակալը:
                Պատերազմական փայլուն հաջողություններին զուգընթաց՝ Դավիթն աշխատում էր բարեկարգել իր երկիրը և մեծ չափով աջակցում էր ավերված շրջանների վերաշինությանը: Դավիթ Դ-ը ձգտում էր երկրի տնտեսական առաջընթացն ապահովել նաև հայ բնակչության ուժերն օգտագործելու միջոցով։ Վրացական պետության բարեհաճ քաղաքականության շնորհիվ լայնորեն թափ ստացավ հայերի տեղաշարժը դեպի Վրաստան, որին էապես նպաստում էր անձամբ Դավիթ Շինարարը: Նա հայերին հատկացրեց Գորի քաղաքը և պայմաններ ստեղծեց, որպիսի նրանք զբաղվեն առևտրով և արհեստներով:
                Դավիթ Շինարարը հարգանքով էր վերաբերում մեծաքանակ հայ բնակչությանը, իսկ հայոց և վրաց եկեղեցիների կրոնադավանաբանական տարբերությունները էական նշանակություն չունեցան այս հարցում: Դավիթը ոչ միայն հովանավորում էր հայերին, այլև աջակցում էր ավերված հայ եկեղեցիների ու վանքերի վերաշինությանը և նվիրաբերություններ էր անում ի նպաստ այդ հաստատությունների: Նմանատիպ օրինակ է ժամանակի ակնառու հայ հոգևորական Հովհաննես Սարկավագի պատվին Դավիթ Շինարարի կողմից Հաղբատին տրված գյուղը և այգին, որի մասին խոսվում է վանքի Ս. Նշան եկեղեցու արևմտյան մուտքի արձանագրության տեքստում: Հայաստանի ավատատիրական տների շատ ներկայացուցիչներ, որոնք այս կամ այն չափով պահպանել էին իրենց գոյությունը, հատկապես երկրի հյուսիսային շրջաններում, Դավիթ Շինարարի կողմից լայն հովանավորություն են ստանում: Նրանց մի մասը քաղաքական-տնտեսական դիրքը պահպանելու, մյուս մասը՝ կորցրածը վերականգնելու, երրորդ մասը՝ նոր դիրք ձեռք բերելու նպատակով ծառայության էին մտնում վրացական բանակում: Այդ ճանապարհով վրաց բանակում սկսեցին կազմակերպվել հայկական զինվորական միավորումներ, որոնց թիվը անընդհատ աճում էր ի հաշիվ հայկական ավատատիրական ուժերի: 
                Սելջուկներից ազատագրելով Հայաստանի այս կամ այն շրջանը՝ վրաց թագավորներն այդտեղ կառավարիչ էին նշանակում հայ իշխանի, և դրանով նրանք ապահովում էին այդ շրջանների կախումը իրենցից, իսկ մյուս կողմից՝ ավելի շահագրգռում հայ ավատատիրական վերնախավին, խթանում նրա ակտիվ մասնակցությունը ռազմական գործողություններին: Հետագայում այս ճանապարհով Մահկանաբերդցիների Արծրունիները և հատկապես Զաքարյան ավատատիրական տան ներկայացուցիչները, շնորհիվ ռազմական հմտության, շատ շուտով աչքի ընկան վրացական արքունիքում, աստիճանաբար ձեռք բերեցին բարձր պաշտոններ և երկրի քաղաքական կյանքում կարևոր դեր խաղացին:
                Այս շրջանում Վրաստանի կազմում ընդգրկված հայկական շատ գավառներ վարչականորեն վրաց Բագրատունիների կամ նրանց ստորակաների(վասալների) տիրույթ էին համարվում: Միասնական պետականության սահմաններում, բնականաբար, միասնական էր և բանակը, իսկ դավանական տարաձայնությունները նկատելիորեն դժվարացնում էին համատեղ հաղթական գործողությունները: Ուստի պատահական չէ, որ Դավիթ Շինարարի իշխանության տարիներին հայ-վրացական եկեղեցական քննարկումներ էին կազմակերպվում՝ փորձելով համադավանության հասնել: Վրաց քաղկեդոնականությանը հարած հայոց վանական որոշ կենտրոններ պակաս ակտիվություն չէին դրսևորում այս հարցում: Ինչպես Պ. Մուրադյանն է նշում, վրացերենով ու հայերենով համապատասխան գրականություն ունենալն ու առձեռն գործածումը օրախնդիր իրողություն էր: Դավանաբանական հարցում հայոց եկեղեցու հետ միավորման միտումները վրացական միջավայրում առավել ակնհայտորեն ի հայտ են գալիս ԺԲ դարի սկզբին:
                Դեռևս 1103 թ. հրավիրված Ռուիս-Ուրբնիսի եկեղեցական ժողովում ընդունված կանոններից երկուսը՝ հոդված 12-ը և 13-ը, վերաբերում էին հայերին, ուր վերջիններս կոչվում են §խաչեցարք¦: Մասնավորապես՝ 12-րդ հոդվածում սահմանվում էր. §հերձվածողներից խաչեցարները հայերն են…Սրանց մասին սահմանում ենք, որ (ուղղափառություն ընդունելու դեպքում) սրանց լիովին մկրտեն ինչպես հեթանոսներին, որովհետև գտանք, որ այլ մեծ եկեղեցիներն այսպես են անում, ինչպես օրինակ Անտիոքի պատրիարքական աթոռն ու նրան հետևող ամբողջ արևելքի եկեղեցիները¦: Հաջորդ հոդվածով արգելվում էր միաբնակների հետ ամուսնությունն ու խնամությունը:
                Դավիթը իր կառավարման վերջին շրջանում ուղղակիորեն դնում է հայ-վրացական դավանանքների միասնության հարցը, որի նպատակով հրավիրվում է հատուկ եկեղեցական ժողով: Այն պետք է տեղի ունեցած լինի Տփղիսի գրավումից հետո՝ 1123-1125թթ. ընթացքում: Ի դեպ՝ այս ժողովին հրավիրվածների թվում առաջիններից մեկը պետք է լինի Հովհաննես Սարկավագը: Երկարատև բանավեճերն ապարդյուն են անցնում։ Ի վերջո՝ հայ-վրացական դավանաբանական միավորումը տեղի չի ունենում:
                Դավիթ Շինարարի վարած այս քաղաքականությունը հետապնդում էր մեկ նպատակ՝ Կովկասի սահմաններում ստեղծել ունիտար պետություն, որի կազմում ներառնված պետք է լինեին նաև հայեր։ Այս համատեքստում հետաքրքրություն են առաջացնում Դավիթ Դ-ի կրած տիտղոսները, որոնց շարքում հիշատակվում են նաև §հայերի թագավոր¦ (მეფე  სომეხთა) և §շահնշահ¦(შაჰნშაჰი) պատվանունները:
                Այսպիսով՝ ԺԲ դարի առաջին քառորդին հայկական տարածքներից Վրացական թագավորությանն անցան Լոռին, Տաշիրը, Շիրակի մի մասը, Անի մայրաքաղաքը, ինչպես նաև մի շարք ամրոցներ: Փաստորեն, այս նախաձեռնություններում էական դերակատարություն ունեցան իրենք հայերը, որոնք ամեն կերպ աջակցեցին վրաց արքային: Իսկ ահա Դավիթ Շինարարը, իր հերթին, օգտվեց այդ հանգամանքից և ազատագրական պայքարի քողի տակ գրավեց վերոնշյալ հայկական տարածքները, ինչն էլ հիմք հանդիսացավ հետագայում այդ շրջանների նկատմամբ Վրաստանի հավակնությունների համար: Դավանաբանական տեսանկյունից, չնայած բազում փորձերին, միասնություն չհաստատվեց: Ամեն դեպքում, հայ-վրացական հարաբերություններն ավելի անմիջական դարձան, իսկ հայկական մի շարք իշխանական տներ ազդեցիկ դիրքեր սկսեցին զբաղեցնել վրաց արքունիքում:
            </div>
            <br>
            Айк Петросян- Армяно-грузинские отношения в первой четверти 12-ого века. – В истории Армении и Грузии первой четверти двенадцатого века, некоторые важные проблемы в советском анамнезе объективно не представлены в связи с идеологическим довлением. Наличие такого пробела препятствует развитию отношений двух стран, поэтому в статье сделана попытка заполнить этот пробел.
            В обсуждении армяно-грузинских отношений данного периода, особое внимание следует уделять включению ряда  армянских областей в состав Грузии, в частности завоевание бывшей столицы армянских Багратидов Ани, армяно-грузинское сотрудничество, религиозные проблемы между армянскими и грузинскими церквями, а также роль армян в грузинской армии. В статье всесторонне представлены все эти вопросы.
            
            <br><br>
            Hayk Petrosyan- Armenian-Georgian relations in the first quarter of the 12th century.   – Some significant problems in the Armenian-Georgian relations of the first quarter of the 12th century were not represented objectively in the Soviet historiography under the circumstances of ideological coercion. The existence of such a gap considerably prevents the development of the relations between the two countries; hence the article is an attempt to fill this gap.
            Considering the relations between Armenia and Georgia at that time, a special attention should be drawn to the inclusion of a number of Armenian areas into the Kingdom of Georgia; especially the conquest of Ani, the former capital of the Armenian Bagratids, the Armenian-Georgian cooperation, dogmatic problems between Armenian and Georgian churches, as well as the role and importance of Armenians in the Georgian army. The article comprehensively represents the issues in question. 
        </div>
    `;
}

export function htmlPostSoon(){
    return`
        <div class="soon-container">
            <i class="fa fa-long-arrow-left" style="font-size:24px"></i>
            <div>
                ...<br>
                Coming Soon <br>
                ...
            </div>
        </div>
    `;
}